onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/DataProcessors/бит_омни_ЕдиныйЧат.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_омни_ЕдиныйЧат</Name>
			<Comment>Рабочее место оператора для просмотра пациентов MAX и ручной переписки с ними.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ИсторияЧатовMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ИсторияЧатовMAX</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.бит_омни_Контакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/DataProcessors/бит_омни_ЕдиныйЧат/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетОбновлениеСписка;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Автообновление = Истина;

	НастроитьВнешнийВидФормы();
	УстановитьУсловноеОформлениеСписка();

	// Результат не используется: при первом заполнении оповещать не о чем.
	ЗагрузитьДиалогиНаСервере();

	ОчиститьЛентуЧатаНаСервере();
	ОбновитьШапкуЧатаНаСервере();
	ОбновитьОтметкуОбновленияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИдетОбновлениеСписка = Ложь;
	ОбновитьДоступностьДействий();
	УправлятьАвтообновлением();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеПоискаПриИзменении(Элемент)

	ОбновитьДанныеФормы(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ФлажокТолькоНепрочитанныеПриИзменении(Элемент)

	ОбновитьДанныеФормы(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ФлажокАвтообновлениеПриИзменении(Элемент)

	УправлятьАвтообновлением();

КонецПроцедуры

&НаКлиенте
Процедура ДиалогиПриАктивизацииСтроки(Элемент)

	Если ИдетОбновлениеСписка = Истина Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.КлючДиалога = КлючТекущегоДиалога Тогда
		Возврат;
	КонецЕсли;

	ОткрытьДиалогНаСервере(
		ТекущиеДанные.Контакт,
		ТекущиеДанные.Пациент,
		ТекущиеДанные.Бот,
		ТекущиеДанные.КлючДиалога);

	ОбновитьДоступностьДействий();

КонецПроцедуры

&НаКлиенте
Процедура ЛентаЧатаДокументСформирован(Элемент)

	ПрокрутитьЛентуВКонец(Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОбработка(Команда)

	ОбновитьДанныеФормы(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбработка(Команда)

	Если Не ЗначениеЗаполнено(ТекущийКонтакт) Тогда
		Сообщить("Выберите диалог в списке слева.");
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ТекстОтвета)) Тогда
		Сообщить("Введите текст сообщения.");
		Возврат;
	КонецЕсли;

	Результат = ОтправитьОтветНаСервере();
	Если Результат.Успех Тогда
		// Текст очищается только при успехе: иначе оператору пришлось бы набирать его заново.
		ТекстОтвета = "";
	КонецЕсли;

	ОбновитьДанныеФормы(Истина);

	Если Не Результат.Успех Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;

	ТекущийЭлемент = Элементы.ТекстОтвета;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуПациентаОбработка(Команда)

	Если Не ЗначениеЗаполнено(ТекущийПациент) Тогда
		Сообщить("Выберите диалог в списке слева.");
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ТекущийПациент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ОбработчикАвтообновления()

	Если Не Автообновление Тогда
		Возврат;
	КонецЕсли;

	ОбновитьДанныеФормы(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиента

&НаКлиенте
Процедура УправлятьАвтообновлением()

	ОтключитьОбработчикОжидания("ОбработчикАвтообновления");
	Если Автообновление Тогда
		ПодключитьОбработчикОжидания("ОбработчикАвтообновления", ИнтервалАвтообновления());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ИнтервалАвтообновления()

	Возврат 20;

КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеФормы(ПерестроитьЛенту)

	ИдетОбновлениеСписка = Истина;
	Попытка
		НовыеСообщения = ОбновитьДанныеФормыНаСервере(ПерестроитьЛенту);
	Исключение
		ИдетОбновлениеСписка = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	ИдетОбновлениеСписка = Ложь;

	ОбновитьДоступностьДействий();
	ПоказатьОповещенияОНовыхСообщениях(НовыеСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещенияОНовыхСообщениях(НовыеСообщения)

	Для Каждого Оповещение Из НовыеСообщения Цикл
		ПоказатьОповещениеПользователя(
			"Новое сообщение в MAX",
			,
			Оповещение.Пациент + ": " + Оповещение.Текст,
			,
			СтатусОповещенияПользователя.Важное,
			Оповещение.Ключ);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьДействий()

	ДиалогВыбран = ЗначениеЗаполнено(ТекущийКонтакт);

	Элементы.ТекстОтвета.Доступность = ДиалогВыбран;
	Элементы.ОтправитьКнопка.Доступность = ДиалогВыбран;
	Элементы.КарточкаПациентаКнопка.Доступность = ЗначениеЗаполнено(ТекущийПациент);

КонецПроцедуры

&НаКлиенте
Процедура ПрокрутитьЛентуВКонец(Элемент)

	Попытка
		ДокументHTML = Элемент.Документ;
		Если ДокументHTML = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Якорь = ДокументHTML.getElementById("feedEnd");
		Если Якорь <> Неопределено Тогда
			Якорь.scrollIntoView();
		КонецЕсли;
	Исключение
		// Прокрутка средствами DOM доступна не на всех платформах: лента остается в начале,
		// сообщение об ошибке оператору не показывается.
		Возврат;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервера

&НаСервере
Процедура НастроитьВнешнийВидФормы()

	ЦветПодписи = ЦветВторичногоТекста();

	Элементы.ГруппаРабочаяОбласть.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаРабочаяОбласть.РастягиватьПоВертикали = Истина;

	Элементы.ГруппаДиалоги.Ширина = 46;
	Элементы.ГруппаДиалоги.РастягиватьПоГоризонтали = Ложь;
	Элементы.ГруппаДиалоги.РастягиватьПоВертикали = Истина;

	Элементы.ПолеПоиска.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.ПолеПоиска.АвтоМаксимальнаяШирина = Ложь;

	Элементы.ГруппаФильтр.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаСостояние.РастягиватьПоГоризонтали = Истина;

	Элементы.НадписьСчетчик.ЦветТекста = ЦветПодписи;
	Элементы.НадписьСчетчик.РастягиватьПоГоризонтали = Истина;
	Элементы.НадписьСчетчик.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.НадписьНовых.ЦветТекста = ЦветАкцента();
	Элементы.НадписьНовых.Шрифт = Новый Шрифт(, , Истина);
	Элементы.НадписьНовых.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.Диалоги.РастягиватьПоГоризонтали = Истина;
	Элементы.Диалоги.РастягиватьПоВертикали = Истина;
	Элементы.Диалоги.ГоризонтальныеЛинии = Ложь;
	Элементы.Диалоги.ВертикальныеЛинии = Ложь;

	Элементы.ДиалогиИмяДиалога.Шрифт = Новый Шрифт(, , Истина);
	Элементы.ДиалогиИмяДиалога.РастягиватьПоГоризонтали = Истина;

	Элементы.ДиалогиСнипет.ЦветТекста = ЦветПодписи;
	Элементы.ДиалогиСнипет.РастягиватьПоГоризонтали = Истина;

	Элементы.ДиалогиВремя.Ширина = 8;
	Элементы.ДиалогиВремя.ЦветТекста = ЦветПодписи;
	Элементы.ДиалогиВремя.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.ДиалогиМеткаНепрочитанных.Ширина = 6;
	Элементы.ДиалогиМеткаНепрочитанных.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.НадписьОбновлено.ЦветТекста = ЦветПодписи;
	Элементы.НадписьОбновлено.РастягиватьПоГоризонтали = Истина;
	Элементы.НадписьОбновлено.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.ГруппаЧат.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаЧат.РастягиватьПоВертикали = Истина;

	Элементы.ГруппаШапкаЧата.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаШапкаЧата.РастягиватьПоВертикали = Ложь;

	Элементы.ЗаголовокЧата.Шрифт = Новый Шрифт(, , Истина, , , , 115);
	Элементы.ПодзаголовокЧата.ЦветТекста = ЦветПодписи;

	Элементы.ЛентаЧата.РастягиватьПоГоризонтали = Истина;
	Элементы.ЛентаЧата.РастягиватьПоВертикали = Истина;

	// Всю свободную высоту забирает лента: поле ввода остается фиксированным.
	Элементы.ГруппаОтправка.РастягиватьПоГоризонтали = Истина;
	Элементы.ГруппаОтправка.РастягиватьПоВертикали = Ложь;
	Элементы.ТекстОтвета.РастягиватьПоВертикали = Ложь;
	Элементы.ТекстОтвета.АвтоМаксимальнаяВысота = Ложь;
	Элементы.ТекстОтвета.МаксимальнаяВысота = 6;

	Элементы.ГруппаКнопкиОтправки.РастягиватьПоГоризонтали = Истина;
	Элементы.ПодсказкаОтправки.ЦветТекста = ЦветПодписи;
	Элементы.ПодсказкаОтправки.РастягиватьПоГоризонтали = Истина;
	Элементы.ОтправитьКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСписка()

	УсловноеОформление.Элементы.Очистить();

	// Имя пациента в диалоге с непрочитанными сообщениями выделяется акцентом.
	ОформлениеИмени = УсловноеОформление.Элементы.Добавить();

	ПолеИмени = ОформлениеИмени.Поля.Элементы.Добавить();
	ПолеИмени.Поле = Новый ПолеКомпоновкиДанных("ДиалогиИмяДиалога");

	ОтборИмени = ОформлениеИмени.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборИмени.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Диалоги.Непрочитано");
	ОтборИмени.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборИмени.ПравоеЗначение = 0;

	ОформлениеИмени.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветАкцента());

	// Счетчик непрочитанных оформляется как метка.
	ОформлениеМетки = УсловноеОформление.Элементы.Добавить();

	ПолеМетки = ОформлениеМетки.Поля.Элементы.Добавить();
	ПолеМетки.Поле = Новый ПолеКомпоновкиДанных("ДиалогиМеткаНепрочитанных");

	ОтборМетки = ОформлениеМетки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборМетки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Диалоги.Непрочитано");
	ОтборМетки.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборМетки.ПравоеЗначение = 0;

	ОформлениеМетки.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветАкцента());
	ОформлениеМетки.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Белый);

	// В диалоге с новыми сообщениями текст последнего сообщения перестает быть блеклым.
	ОформлениеСнипета = УсловноеОформление.Элементы.Добавить();

	ПолеСнипета = ОформлениеСнипета.Поля.Элементы.Добавить();
	ПолеСнипета.Поле = Новый ПолеКомпоновкиДанных("ДиалогиСнипет");

	ОтборСнипета = ОформлениеСнипета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСнипета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Диалоги.Непрочитано");
	ОтборСнипета.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборСнипета.ПравоеЗначение = 0;

	ОформлениеСнипета.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноГрифельноСерый);
	ОформлениеСнипета.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеФормыНаСервере(ПерестроитьЛенту)

	НовыеСообщения = ЗагрузитьДиалогиНаСервере();

	Если ЗначениеЗаполнено(ТекущийПациент) Тогда
		ЗагрузитьСообщенияНаСервере(ПерестроитьЛенту);
		// Открытая переписка помечена прочитанной, счетчик в списке нужно погасить сразу.
		СброситьСчетчикНепрочитанныхНаСервере(КлючТекущегоДиалога);
		ОбновитьШапкуЧатаНаСервере();
	Иначе
		ОчиститьЛентуЧатаНаСервере();
	КонецЕсли;

	ОбновитьОтметкуОбновленияНаСервере();

	Возврат НовыеСообщения;

КонецФункции

&НаСервере
Процедура ОткрытьДиалогНаСервере(Контакт, Пациент, Бот, КлючДиалога)

	ТекущийКонтакт = Контакт;
	ТекущийПациент = Пациент;
	ТекущийБот = Бот;
	КлючТекущегоДиалога = КлючДиалога;

	ОбновитьШапкуЧатаНаСервере();
	ЗагрузитьСообщенияНаСервере(Истина);
	СброситьСчетчикНепрочитанныхНаСервере(КлючДиалога);

КонецПроцедуры

// Перезаполняет список диалогов.
//
// Возвращаемое значение:
//   Массив из Структура - описания входящих сообщений, пришедших после предыдущего
//                         обновления; при первом заполнении списка всегда пустой.
&НаСервере
Функция ЗагрузитьДиалогиНаСервере()

	СвернутыеДиалоги = СвернутыеДиалогиНаСервере();

	Диалоги.Очистить();
	ВсегоНепрочитанных = 0;
	НоваяГраница = ГраницаОповещений;
	НовыеСообщения = Новый Массив;

	Для Каждого СтрокаИсточника Из СвернутыеДиалоги Цикл
		СтрокаДиалога = Диалоги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДиалога, СтрокаИсточника);

		СтрокаДиалога.КлючДиалога = СформироватьКлючДиалога(СтрокаИсточника.Пациент, СтрокаИсточника.Бот);
		СтрокаДиалога.ИмяДиалога = Лев(Строка(СтрокаИсточника.Пациент), 150);
		СтрокаДиалога.Снипет = СнипетДиалога(СтрокаИсточника);
		СтрокаДиалога.Время = ПредставлениеВремениДиалога(СтрокаИсточника.ДатаПоследнегоСообщения);
		СтрокаДиалога.МеткаНепрочитанных = МеткаНепрочитанных(СтрокаИсточника.Непрочитано);

		ВсегоНепрочитанных = ВсегоНепрочитанных + СтрокаИсточника.Непрочитано;

		Если Не СтрокаИсточника.ПоследнееВходящее Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаИсточника.ДатаПоследнегоСообщения > НоваяГраница Тогда
			НоваяГраница = СтрокаИсточника.ДатаПоследнегоСообщения;
		КонецЕсли;

		// При первом заполнении списка граница еще не установлена: вся история
		// считается уже виденной, иначе оператор получил бы пачку оповещений сразу.
		Если ЗначениеЗаполнено(ГраницаОповещений)
			И СтрокаИсточника.ДатаПоследнегоСообщения > ГраницаОповещений Тогда
			НовыеСообщения.Добавить(Новый Структура(
				"Пациент, Текст, Ключ",
				СтрокаДиалога.ИмяДиалога,
				СтрокаДиалога.Снипет,
				СтрокаДиалога.КлючДиалога));
		КонецЕсли;
	КонецЦикла;

	ГраницаОповещений = НоваяГраница;

	ОбновитьСчетчикДиалоговНаСервере(Диалоги.Количество(), ВсегоНепрочитанных);
	ВосстановитьТекущийДиалогНаСервере();

	Возврат НовыеСообщения;

КонецФункции

&НаСервере
Функция СвернутыеДиалогиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Контакты.Ссылка КАК Контакт,
				   |	ВЫРАЗИТЬ(Контакты.Получатель КАК Справочник.Клиенты) КАК Пациент,
				   |	Контакты.Наименование КАК ИмяMAX,
				   |	Контакты.Бот КАК Бот
				   |ПОМЕСТИТЬ ВТКонтакты
				   |ИЗ
				   |	Справочник.бит_омни_Контакты КАК Контакты
				   |ГДЕ
				   |	Контакты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)
				   |	И Контакты.Получатель ССЫЛКА Справочник.Клиенты
				   |	И НЕ Контакты.ПометкаУдаления
				   |	И (&СтрокаПоиска = """"
				   |		ИЛИ Контакты.Наименование ПОДОБНО &ШаблонПоиска
				   |		ИЛИ ВЫРАЗИТЬ(Контакты.Получатель КАК Справочник.Клиенты).Наименование ПОДОБНО &ШаблонПоиска)
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Контакт,
				   |	Бот
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	История.Контакт КАК Контакт,
				   |	История.Бот КАК Бот,
				   |	МАКСИМУМ(История.Период) КАК ДатаПоследнегоСообщения,
				   |	СУММА(ВЫБОР
				   |			КОГДА История.Входящее
				   |					И НЕ История.Прочитано
				   |				ТОГДА 1
				   |			ИНАЧЕ 0
				   |		КОНЕЦ) КАК Непрочитано
				   |ПОМЕСТИТЬ ВТПоследние
				   |ИЗ
				   |	РегистрСведений.бит_омни_ИсторияЧатовMAX КАК История
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтакты КАК Контакты
				   |		ПО История.Контакт = Контакты.Контакт
				   |			И История.Бот = Контакты.Бот
				   |СГРУППИРОВАТЬ ПО
				   |	История.Контакт,
				   |	История.Бот
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Контакт,
				   |	Бот
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Контакты.Контакт КАК Контакт,
				   |	Контакты.Пациент КАК Пациент,
				   |	Контакты.ИмяMAX КАК ИмяMAX,
				   |	Контакты.Бот КАК Бот,
				   |	ЕСТЬNULL(История.Текст, """") КАК ПоследнееСообщение,
				   |	Последние.ДатаПоследнегоСообщения КАК ДатаПоследнегоСообщения,
				   |	ЕСТЬNULL(Последние.Непрочитано, 0) КАК Непрочитано,
				   |	ЕСТЬNULL(История.Входящее, ЛОЖЬ) КАК ПоследнееВходящее
				   |ИЗ
				   |	ВТКонтакты КАК Контакты
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследние КАК Последние
				   |		ПО Контакты.Контакт = Последние.Контакт
				   |			И Контакты.Бот = Последние.Бот
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_ИсторияЧатовMAX КАК История
				   |		ПО Последние.Контакт = История.Контакт
				   |			И Последние.Бот = История.Бот
				   |			И Последние.ДатаПоследнегоСообщения = История.Период
				   |ГДЕ
				   |	НЕ &ТолькоНепрочитанные
				   |		ИЛИ ЕСТЬNULL(Последние.Непрочитано, 0) > 0
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	ДатаПоследнегоСообщения УБЫВ,
				   |	Пациент";

	СтрокаОтбора = СокрЛП(СтрокаПоиска);
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаОтбора);
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СтрокаОтбора + "%");
	Запрос.УстановитьПараметр("ТолькоНепрочитанные", ТолькоНепрочитанные);

	РезультатыПакета = Запрос.ВыполнитьПакет();
	ТаблицаКонтактов = РезультатыПакета[РезультатыПакета.Количество() - 1].Выгрузить();

	// Один пациент может быть заведен несколькими контактами MAX: диалоги сворачиваются
	// до пары "пациент + бот", чтобы оператор видел одну переписку.
	СвернутыеДиалоги = ТаблицаКонтактов.СкопироватьКолонки();
	УчтенныеКонтакты = Новый Соответствие;

	Для Каждого СтрокаКонтакта Из ТаблицаКонтактов Цикл
		ОтборДиалога = Новый Структура("Пациент, Бот", СтрокаКонтакта.Пациент, СтрокаКонтакта.Бот);
		НайденныеДиалоги = СвернутыеДиалоги.НайтиСтроки(ОтборДиалога);
		Если НайденныеДиалоги.Количество() = 0 Тогда
			СтрокаДиалога = СвернутыеДиалоги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДиалога, СтрокаКонтакта);
			СтрокаДиалога.Непрочитано = 0;
		Иначе
			СтрокаДиалога = НайденныеДиалоги[0];
		КонецЕсли;

		КлючКонтакта = Строка(СтрокаКонтакта.Контакт.УникальныйИдентификатор());
		Если УчтенныеКонтакты.Получить(КлючКонтакта) = Неопределено Тогда
			СтрокаДиалога.Непрочитано = СтрокаДиалога.Непрочитано + СтрокаКонтакта.Непрочитано;
			УчтенныеКонтакты.Вставить(КлючКонтакта, Истина);
		КонецЕсли;

		ЭтоБолееНовоеСообщение = СтрокаКонтакта.ДатаПоследнегоСообщения > СтрокаДиалога.ДатаПоследнегоСообщения;
		ЭтоОтветВТуЖеСекунду = СтрокаКонтакта.ДатаПоследнегоСообщения = СтрокаДиалога.ДатаПоследнегоСообщения
			И СтрокаДиалога.ПоследнееВходящее И Не СтрокаКонтакта.ПоследнееВходящее;
		Если ЭтоБолееНовоеСообщение Или ЭтоОтветВТуЖеСекунду Тогда
			СтрокаДиалога.Контакт = СтрокаКонтакта.Контакт;
			СтрокаДиалога.ИмяMAX = СтрокаКонтакта.ИмяMAX;
			СтрокаДиалога.ПоследнееСообщение = СтрокаКонтакта.ПоследнееСообщение;
			СтрокаДиалога.ДатаПоследнегоСообщения = СтрокаКонтакта.ДатаПоследнегоСообщения;
			СтрокаДиалога.ПоследнееВходящее = СтрокаКонтакта.ПоследнееВходящее;
		КонецЕсли;
	КонецЦикла;

	СвернутыеДиалоги.Сортировать("ДатаПоследнегоСообщения Убыв, Пациент");

	Возврат СвернутыеДиалоги;

КонецФункции

&НаСервере
Процедура ВосстановитьТекущийДиалогНаСервере()

	Если ПустаяСтрока(КлючТекущегоДиалога) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаДиалога Из Диалоги Цикл
		Если СтрокаДиалога.КлючДиалога = КлючТекущегоДиалога Тогда
			Элементы.Диалоги.ТекущаяСтрока = СтрокаДиалога.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СброситьСчетчикНепрочитанныхНаСервере(КлючДиалога)

	Для Каждого СтрокаДиалога Из Диалоги Цикл
		Если СтрокаДиалога.КлючДиалога = КлючДиалога Тогда
			СтрокаДиалога.Непрочитано = 0;
			СтрокаДиалога.МеткаНепрочитанных = "";
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчикДиалоговНаСервере(КоличествоДиалогов, КоличествоНепрочитанных)

	Если КоличествоДиалогов = 0 Тогда
		Элементы.НадписьСчетчик.Заголовок = "Ничего не найдено";
	Иначе
		Элементы.НадписьСчетчик.Заголовок = СтрШаблон("Диалогов: %1", КоличествоДиалогов);
	КонецЕсли;

	Элементы.НадписьНовых.Видимость = КоличествоНепрочитанных > 0;
	Элементы.НадписьНовых.Заголовок = СтрШаблон("новых: %1", КоличествоНепрочитанных);

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтметкуОбновленияНаСервере()

	Элементы.НадписьОбновлено.Заголовок = СтрШаблон(
		"Обновлено в %1", Формат(ТекущаяДатаСеанса(), "ДФ=HH:mm:ss"));

КонецПроцедуры

&НаСервере
Процедура ОбновитьШапкуЧатаНаСервере()

	Если Не ЗначениеЗаполнено(ТекущийПациент) Тогда
		Элементы.ЗаголовокЧата.Заголовок = "Диалог не выбран";
		Элементы.ПодзаголовокЧата.Заголовок = "Выберите пациента в списке слева";
		Возврат;
	КонецЕсли;

	ИмяВMAX = "";
	Для Каждого СтрокаДиалога Из Диалоги Цикл
		Если СтрокаДиалога.КлючДиалога = КлючТекущегоДиалога Тогда
			ИмяВMAX = СтрокаДиалога.ИмяMAX;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Элементы.ЗаголовокЧата.Заголовок = Строка(ТекущийПациент);

	ЧастиПодзаголовка = Новый Массив;
	Если Не ПустаяСтрока(ИмяВMAX) Тогда
		ЧастиПодзаголовка.Добавить(СтрШаблон("MAX: %1", ИмяВMAX));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийБот) Тогда
		ЧастиПодзаголовка.Добавить(СтрШаблон("бот: %1", ТекущийБот));
	КонецЕсли;

	Элементы.ПодзаголовокЧата.Заголовок = СтрСоединить(ЧастиПодзаголовка, " · ");

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСообщенияНаСервере(ПерестроитьЛенту)

	Если Не ЗначениеЗаполнено(ТекущийПациент) Тогда
		ОчиститьЛентуЧатаНаСервере();
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	История.Период КАК Период,
				   |	История.Входящее КАК Входящее,
				   |	История.Прочитано КАК Прочитано,
				   |	История.Автор КАК Автор,
				   |	История.Текст КАК Текст,
				   |	История.Статус КАК Статус,
				   |	История.ОписаниеОшибки КАК ОписаниеОшибки,
				   |	История.ВидСообщения КАК ВидСообщения
				   |ИЗ
				   |	РегистрСведений.бит_омни_ИсторияЧатовMAX КАК История
				   |ГДЕ
				   |	История.Контакт.Получатель = &Пациент
				   |	И История.Бот = &Бот
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Период";

	Запрос.УстановитьПараметр("Пациент", ТекущийПациент);
	Запрос.УстановитьПараметр("Бот", ТекущийБот);

	ТаблицаСообщений = Запрос.Выполнить().Выгрузить();

	ЕстьНепрочитанные = Ложь;
	Для Каждого Сообщение Из ТаблицаСообщений Цикл
		Если Сообщение.Входящее И Не Сообщение.Прочитано Тогда
			ЕстьНепрочитанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьНепрочитанные Тогда
		ПометитьВходящиеПрочитаннымиНаСервере();
	КонецЕсли;

	НовыйОтпечаток = ОтпечатокСообщений(ТаблицаСообщений);
	Если Не ПерестроитьЛенту И НовыйОтпечаток = ОтпечатокЛенты Тогда
		Возврат;
	КонецЕсли;

	ОтпечатокЛенты = НовыйОтпечаток;
	ЛентаЧата = ЛентаЧатаHTML(ТаблицаСообщений);

КонецПроцедуры

&НаСервере
Процедура ОчиститьЛентуЧатаНаСервере()

	ОтпечатокЛенты = "";
	ЛентаЧата = ЗаглушкаЛентыHTML();

КонецПроцедуры

&НаСервере
Процедура ПометитьВходящиеПрочитаннымиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Контакты.Ссылка КАК Контакт
				   |ИЗ
				   |	Справочник.бит_омни_Контакты КАК Контакты
				   |ГДЕ
				   |	Контакты.Получатель = &Пациент
				   |	И Контакты.Бот = &Бот
				   |	И НЕ Контакты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Пациент", ТекущийПациент);
	Запрос.УстановитьПараметр("Бот", ТекущийБот);

	ВыборкаКонтактов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаКонтактов.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.бит_омни_ИсторияЧатовMAX.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контакт.Установить(ВыборкаКонтактов.Контакт);
		НаборЗаписей.Отбор.Бот.Установить(ТекущийБот);
		НаборЗаписей.Отбор.Входящее.Установить(Истина);
		НаборЗаписей.Прочитать();

		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Не Запись.Прочитано Тогда
				Запись.Прочитано = Истина;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;

		Если ЕстьИзменения Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ОтправитьОтветНаСервере()

	Попытка
		РезультатОтправки = бит_омни_ИнтеграцияСMAX.ОтправитьТекстовоеСообщение(
			СокрЛП(ТекстОтвета), ТекущийКонтакт, ТекущийБот);

		Успех = Истина;
		ОписаниеОшибки = "";
		Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда
			ЗначениеУспеха = Неопределено;
			Если РезультатОтправки.Свойство("success", ЗначениеУспеха)
				И ТипЗнч(ЗначениеУспеха) = Тип("Булево") Тогда
				Успех = ЗначениеУспеха;
			КонецЕсли;

			СообщениеОбОшибке = Неопределено;
			Если РезультатОтправки.Свойство("message", СообщениеОбОшибке)
				И ТипЗнч(СообщениеОбОшибке) = Тип("Строка") Тогда
				ОписаниеОшибки = СообщениеОбОшибке;
			КонецЕсли;
		КонецЕсли;

		Если Успех Тогда
			РезультатЗаписи = РезультатПоследнейОтправкиНаСервере();
			Если РезультатЗаписи <> Неопределено И РезультатЗаписи.Статус = "Ошибка" Тогда
				Успех = Ложь;
				ОписаниеОшибки = РезультатЗаписи.ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;

		Если Не Успех И ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибки = "MAX отклонил сообщение.";
		КонецЕсли;

		Возврат Новый Структура(
			"Успех, ОписаниеОшибки",
			Успех,
			?(Успех, "", ОписаниеОшибки));
	Исключение
		Возврат Новый Структура(
			"Успех, ОписаниеОшибки",
			Ложь,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецФункции

&НаСервере
Функция РезультатПоследнейОтправкиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				   |	История.Статус КАК Статус,
				   |	История.ОписаниеОшибки КАК ОписаниеОшибки
				   |ИЗ
				   |	РегистрСведений.бит_омни_ИсторияЧатовMAX КАК История
				   |ГДЕ
				   |	История.Контакт = &Контакт
				   |	И История.Бот = &Бот
				   |	И НЕ История.Входящее
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	История.Период УБЫВ";

	Запрос.УстановитьПараметр("Контакт", ТекущийКонтакт);
	Запрос.УстановитьПараметр("Бот", ТекущийБот);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура(
			"Статус, ОписаниеОшибки",
			Выборка.Статус,
			Выборка.ОписаниеОшибки);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область ФормированиеЛентыЧата

&НаСервереБезКонтекста
Функция ЛентаЧатаHTML(ТаблицаСообщений)

	Если ТаблицаСообщений.Количество() = 0 Тогда
		Возврат ЗаготовкаЛентыHTML(
			"<div class=""empty""><div class=""empty-title"">Сообщений пока нет</div>"
			+ "<div class=""empty-hint"">Напишите первым, и сообщение уйдет пациенту в MAX.</div></div>");
	КонецЕсли;

	ЧастиЛенты = Новый Массив;
	ПредыдущийДень = '00010101';
	ПредыдущееВходящее = Неопределено;
	ПредыдущийПериод = '00010101';

	Для Каждого Сообщение Из ТаблицаСообщений Цикл
		ДеньСообщения = НачалоДня(Сообщение.Период);
		Если ДеньСообщения <> ПредыдущийДень Тогда
			ЧастиЛенты.Добавить("<div class=""day""><span>"
				+ ЭкранироватьТекстДляHTML(ПредставлениеДняЛенты(ДеньСообщения))
				+ "</span></div>");
			ПредыдущийДень = ДеньСообщения;
			ПредыдущееВходящее = Неопределено;
		КонецЕсли;

		ПродолжениеСерии = (ПредыдущееВходящее = Сообщение.Входящее)
			И (Сообщение.Период - ПредыдущийПериод) <= 300;

		ЧастиЛенты.Добавить(ПузырекСообщенияHTML(Сообщение, ПродолжениеСерии));

		ПредыдущееВходящее = Сообщение.Входящее;
		ПредыдущийПериод = Сообщение.Период;
	КонецЦикла;

	Возврат ЗаготовкаЛентыHTML(СтрСоединить(ЧастиЛенты, ""));

КонецФункции

&НаСервереБезКонтекста
Функция ПузырекСообщенияHTML(Сообщение, ПродолжениеСерии)

	КлассСтроки = ?(Сообщение.Входящее, "row in", "row out");
	Если ПродолжениеСерии Тогда
		КлассСтроки = КлассСтроки + " cont";
	КонецЕсли;

	ЧастиПузырька = Новый Массив;
	ЧастиПузырька.Добавить("<div class=""" + КлассСтроки + """><div class=""bubble"">");

	Если Не ПродолжениеСерии Тогда
		ЧастиПузырька.Добавить("<div class=""who"">"
			+ ЭкранироватьТекстДляHTML(АвторСообщения(Сообщение)) + "</div>");
	КонецЕсли;

	ТекстСообщения = СтрЗаменить(Строка(Сообщение.Текст), Символы.ВК, "");

	Если ЭтоВложение(Сообщение.ВидСообщения) Тогда
		ЧастиПузырька.Добавить("<div class=""att"">Вложение: "
			+ ЭкранироватьТекстДляHTML(Сообщение.ВидСообщения) + "</div>");

		// Интеграция подставляет в текст "[Вложение: ...]", когда сообщение состоит
		// из одного вложения. Дублировать эту подпись под чипом не нужно.
		Если СокрЛП(ТекстСообщения) = СтрШаблон("[Вложение: %1]", Сообщение.ВидСообщения) Тогда
			ТекстСообщения = "";
		КонецЕсли;
	КонецЕсли;

	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ЧастиПузырька.Добавить("<div class=""text"">"
			+ ЭкранироватьТекстДляHTML(ТекстСообщения) + "</div>");
	КонецЕсли;

	ЧастиПузырька.Добавить("<div class=""meta"">"
		+ ЭкранироватьТекстДляHTML(МетаСообщения(Сообщение)) + "</div>");

	Если Не ПустаяСтрока(Сообщение.ОписаниеОшибки) Тогда
		ЧастиПузырька.Добавить("<div class=""err"">"
			+ ЭкранироватьТекстДляHTML(Лев(СокрЛП(Сообщение.ОписаниеОшибки), 500)) + "</div>");
	КонецЕсли;

	ЧастиПузырька.Добавить("</div></div>");

	Возврат СтрСоединить(ЧастиПузырька, "");

КонецФункции

&НаСервереБезКонтекста
Функция АвторСообщения(Сообщение)

	Автор = СокрЛП(Строка(Сообщение.Автор));
	Если Не ПустаяСтрока(Автор) Тогда
		Возврат Автор;
	КонецЕсли;

	Возврат ?(Сообщение.Входящее, "Пациент", "Клиника");

КонецФункции

&НаСервереБезКонтекста
Функция МетаСообщения(Сообщение)

	Время = Формат(Сообщение.Период, "ДФ=HH:mm");
	Если Сообщение.Входящее Или ПустаяСтрока(Сообщение.Статус) Тогда
		Возврат Время;
	КонецЕсли;

	Возврат Время + " · " + НРег(СокрЛП(Сообщение.Статус));

КонецФункции

&НаСервереБезКонтекста
Функция ЭтоВложение(ВидСообщения)

	Вид = НРег(СокрЛП(Строка(ВидСообщения)));
	Возврат Не ПустаяСтрока(Вид) И Вид <> "text";

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеДняЛенты(ДеньСообщения)

	Сегодня = НачалоДня(ТекущаяДатаСеанса());

	Если ДеньСообщения = Сегодня Тогда
		Возврат "Сегодня";
	ИначеЕсли ДеньСообщения = Сегодня - 86400 Тогда
		Возврат "Вчера";
	ИначеЕсли Год(ДеньСообщения) = Год(Сегодня) Тогда
		Возврат Формат(ДеньСообщения, "ДФ='d MMMM'");
	КонецЕсли;

	Возврат Формат(ДеньСообщения, "ДФ='d MMMM yyyy'");

КонецФункции

&НаСервереБезКонтекста
Функция ЗаглушкаЛентыHTML()

	Возврат ЗаготовкаЛентыHTML(
		"<div class=""empty""><div class=""empty-title"">Диалог не выбран</div>"
		+ "<div class=""empty-hint"">Выберите пациента в списке слева, чтобы открыть переписку.</div></div>");

КонецФункции

&НаСервереБезКонтекста
Функция ЗаготовкаЛентыHTML(СодержимоеHTML)

	Возврат "<html><head><meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""/>"
		+ "<style>" + СтилиЛентыHTML() + "</style></head><body>"
		+ СодержимоеHTML
		+ "<div id=""feedEnd""></div>"
		+ "<script>window.onload=function(){var e=document.getElementById('feedEnd');if(e){e.scrollIntoView();}};</script>"
		+ "</body></html>";

КонецФункции

&НаСервереБезКонтекста
Функция СтилиЛентыHTML()

	Возврат "
		|html,body{margin:0;padding:0;}
		|body{background:#EFF2F6;color:#1A1F26;padding:10px 14px 16px;
		|	font-family:'Segoe UI',Tahoma,Verdana,Arial,sans-serif;font-size:13px;line-height:1.45;}
		|.day{text-align:center;margin:14px 0 8px;}
		|.day span{display:inline-block;padding:2px 10px;border-radius:10px;
		|	background:#DDE3EC;color:#5A6472;font-size:11px;}
		|.row{margin:6px 0;}
		|.row.cont{margin:2px 0;}
		|.row.out{text-align:right;}
		|.bubble{display:inline-block;text-align:left;max-width:66%;padding:7px 11px 5px 11px;
		|	border-radius:14px;box-shadow:0 1px 2px rgba(16,24,40,0.10);}
		|.in .bubble{background:#FFFFFF;border-top-left-radius:4px;}
		|.out .bubble{background:#DCEAFB;border-top-right-radius:4px;}
		|.who{font-size:11px;font-weight:bold;color:#5A6472;margin-bottom:2px;}
		|.out .who{color:#2F6EA8;}
		|.text{white-space:pre-wrap;word-wrap:break-word;}
		|.meta{margin-top:3px;font-size:10px;color:#8B95A3;text-align:right;}
		|.att{display:inline-block;margin-bottom:3px;padding:1px 6px;border-radius:6px;
		|	background:#E4E9F0;color:#48525F;font-size:11px;}
		|.err{margin-top:4px;padding:3px 7px;border-radius:6px;
		|	background:#FDECEA;color:#B02A1E;font-size:11px;}
		|.empty{margin-top:22%;text-align:center;color:#7A838F;}
		|.empty-title{font-size:15px;color:#5A6472;margin-bottom:4px;}
		|.empty-hint{font-size:12px;}
		|";

КонецФункции

&НаСервереБезКонтекста
Функция ЭкранироватьТекстДляHTML(Значение)

	Результат = Строка(Значение);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиентСервер

&НаСервереБезКонтекста
Функция СформироватьКлючДиалога(Пациент, Бот)

	Возврат Строка(Пациент.УникальныйИдентификатор())
		+ "|" + Строка(Бот.УникальныйИдентификатор());

КонецФункции

&НаСервереБезКонтекста
Функция СнипетДиалога(СтрокаДиалога)

	Текст = Лев(СокрЛП(СтрокаДиалога.ПоследнееСообщение), 250);
	Текст = СтрЗаменить(Текст, Символы.ВК, " ");
	Текст = СтрЗаменить(Текст, Символы.ПС, " ");
	Текст = СтрЗаменить(Текст, Символы.Таб, " ");
	Пока СтрНайти(Текст, "  ") > 0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	Текст = СокрЛП(Текст);

	Если ПустаяСтрока(Текст) Тогда
		Возврат "Нет сообщений";
	КонецЕсли;

	Если Не СтрокаДиалога.ПоследнееВходящее Тогда
		Текст = "Вы: " + Текст;
	КонецЕсли;

	Возврат Лев(Текст, 250);

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеВремениДиалога(ДатаСообщения)

	Если Не ЗначениеЗаполнено(ДатаСообщения) Тогда
		Возврат "";
	КонецЕсли;

	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	ДеньСообщения = НачалоДня(ДатаСообщения);

	Если ДеньСообщения = Сегодня Тогда
		Возврат Формат(ДатаСообщения, "ДФ=HH:mm");
	ИначеЕсли ДеньСообщения = Сегодня - 86400 Тогда
		Возврат "вчера";
	ИначеЕсли Год(ДеньСообщения) = Год(Сегодня) Тогда
		Возврат Формат(ДатаСообщения, "ДФ='d MMM'");
	КонецЕсли;

	Возврат Формат(ДатаСообщения, "ДФ=dd.MM.yy");

КонецФункции

&НаСервереБезКонтекста
Функция МеткаНепрочитанных(КоличествоНепрочитанных)

	Если КоличествоНепрочитанных <= 0 Тогда
		Возврат "";
	ИначеЕсли КоличествоНепрочитанных > 99 Тогда
		Возврат " 99+ ";
	КонецЕсли;

	Возврат " " + Формат(КоличествоНепрочитанных, "ЧГ=") + " ";

КонецФункции

&НаСервереБезКонтекста
Функция ОтпечатокСообщений(ТаблицаСообщений)

	Количество = ТаблицаСообщений.Количество();
	Если Количество = 0 Тогда
		Возврат "0";
	КонецЕсли;

	ПоследнееСообщение = ТаблицаСообщений[Количество - 1];

	Возврат Формат(Количество, "ЧГ=")
		+ "|" + Формат(ПоследнееСообщение.Период, "ДФ=yyyyMMddHHmmss")
		+ "|" + Строка(ПоследнееСообщение.Статус);

КонецФункции

// Оформление списка задается web-цветами: в конфигурации нет элементов стиля,
// на которые можно опереться (см. историю формы).
&НаСервереБезКонтекста
Функция ЦветАкцента()

	Возврат WebЦвета.СинийСоСтальнымОттенком;

КонецФункции

&НаСервереБезКонтекста
Функция ЦветВторичногоТекста()

	Возврат WebЦвета.СветлоГрифельноСерый;

КонецФункции

#КонецОбласти
